app/views/uplifts/uplift.haml

SELECT "elections".* FROM "elections"
SELECT "selections".* FROM "selections"
---
          %td
            -if ((Selection.all.length == 0) || (Selection.all[0].eid == nil) || (! Election.all.any? {|e| e.id == Selection.all[0].eid}))