app/views/elections/index.html.haml

SELECT "elections".* FROM "elections"
SELECT "selections".* FROM "selections"
---
      %td{:style=>"padding-right:6px;padding-left:6px"}= election.day
      %td{:style=>"padding-right:6px;padding-left:6px;font-weight:bold;"}= (((Selection.all.length > 0) and (election.id == Selection.all[0].eid)) ? "&lowast;".html_safe : "" )