app/views/elections/show.html.haml


    - @election.voter_transaction_logs.each do |vtl|
---
SELECT "voter_transaction_logs".* FROM "voter_transaction_logs" WHERE "voter_transaction_logs"."election_id" = 9