app/views/pages/front.haml

          %td
            %h3= "Election: "+(((Selection.all.length == 0) && "None Selected") || Selection.all[0].ename)
---
SELECT "elections".* FROM "elections"
SELECT "selections".* FROM "selections"