app/controllers/elections_controller.rb

SELECT "elections".* FROM "elections"
SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT 1  [["id", "10"]]
SELECT "selections".* FROM "selections"
---
  def index
    @elections = Election.all
    eid = (Election.all.length == 1 ? Election.all[0].id : params[:id])
    if (params[:select] || Election.all.length == 1)
      @election = Election.find(eid)
      ename = @election.name+" ("+@election.day.to_s+")"
      if (Selection.all.length == 0)

SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @election = Election.find(params[:id])

SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @election = Election.find(params[:id])

INSERT INTO "elections" ("created_at", "day", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 06 Mar 2012 23:54:11 UTC +00:00], ["day", Tue, 06 Nov 2012], ["name", "Nov 6, 2012"], ["updated_at", Tue, 06 Mar 2012 23:54:11 UTC +00:00]]
---
  def create
    @election = Election.new(params[:election])

    respond_to do |format|
      if @election.save

SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "elections" SET "name" = 'Presidential', "day" = '2012-11-06', "updated_at" = '2012-03-07 03:50:11.957498' WHERE "elections"."id" = 8
---
  def update
    @election = Election.find(params[:id])

    respond_to do |format|
      if @election.update_attributes(params[:election])

SELECT "elections".* FROM "elections" WHERE "elections"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "elections" WHERE "elections"."id" = ?  [["id", 3]]
SELECT "elections".* FROM "elections"
SELECT "selections".* FROM "selections"
---
  def destroy
    @election = Election.find(params[:id])
    @election.destroy

    did = params[:id]
    if ((Selection.all.length > 0) &&
        ((Selection.all[0].eid == did) || (Election.all.length == 0)))