app/controllers/elections_controller.rb

  def show
    @election = Election.find(params[:id])
    ename = @election.name+" ("+@election.day.to_s+")"
    if (Selection.all.length < 1)
---
SELECT "selections".* FROM "selections"