app/controllers/selections_controller.rb

  def index
    @selections = Selection.all
---
SELECT "selections".* FROM "selections"

  def show
    @selection = Selection.find(params[:id])
---
SELECT "selections".* FROM "selections" WHERE "selections"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @selection = Selection.find(params[:id])
---
SELECT "selections".* FROM "selections" WHERE "selections"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @selection = Selection.new(params[:selection])

    respond_to do |format|
      if @selection.save
---
INSERT INTO "selections" ("created_at", "eid", "ename", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 08 Mar 2012 05:33:12 UTC +00:00], ["eid", 9], ["ename", "General (2012-11-06)"], ["updated_at", Thu, 08 Mar 2012 05:33:12 UTC +00:00]]

  def update
    @selection = Selection.find(params[:id])

    respond_to do |format|
      if @selection.update_attributes(params[:selection])
---
SELECT "selections".* FROM "selections" WHERE "selections"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "selections" SET "ename" = 'GeneralX (2012-11-06)', "updated_at" = '2012-03-08 06:09:24.369303' WHERE "selections"."id" = 1