app/controllers/voter_transaction_logs_controller.rb

SELECT "voter_transaction_logs".* FROM "voter_transaction_logs"
---
  def index
    @voter_transaction_logs = VoterTransactionLog.all

SELECT "voter_transaction_logs".* FROM "voter_transaction_logs" WHERE "voter_transaction_logs"."id" = ? LIMIT 1  [["id", "20"]]
---
  def show
    @voter_transaction_log = VoterTransactionLog.find(params[:id])

SELECT "voter_transaction_logs".* FROM "voter_transaction_logs" WHERE "voter_transaction_logs"."id" = ? LIMIT 1  [["id", "20"]]
---
  def edit
    @voter_transaction_log = VoterTransactionLog.find(params[:id])

SELECT "voter_transaction_logs".* FROM "voter_transaction_logs" WHERE "voter_transaction_logs"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "voter_transaction_logs" WHERE "voter_transaction_logs"."id" = ?  [["id", 1]]
---
  def destroy
    @voter_transaction_log = VoterTransactionLog.find(params[:id])
    @voter_transaction_log.destroy