app/controllers/voter_transaction_records_controller.rb

  def index
    @voter_transaction_records = VoterTransactionRecord.all
---
SELECT "voter_transaction_records".* FROM "voter_transaction_records"

  def show
    @voter_transaction_record = VoterTransactionRecord.find(params[:id])
---
SELECT "voter_transaction_records".* FROM "voter_transaction_records" WHERE "voter_transaction_records"."id" = ? LIMIT 1  [["id", "40"]]

  def destroy
    @voter_transaction_record = VoterTransactionRecord.find(params[:id])
    @voter_transaction_record.destroy
---
SELECT "voter_transaction_records".* FROM "voter_transaction_records" WHERE "voter_transaction_records"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "voter_transaction_records" WHERE "voter_transaction_records"."id" = ?  [["id", 2]]