app/views/voter_transaction_logs/index.html.haml

        %td
        %td{:style=>"padding-right:6px;padding-left:6px"}= voter_transaction_log.voter_transaction_records.length
---
SELECT "voter_transaction_records".* FROM "voter_transaction_records" WHERE "voter_transaction_records"."voter_transaction_log_id" = 129