app/views/voter_transaction_logs/show.html.haml

SELECT "voter_transaction_records".* FROM "voter_transaction_records" WHERE "voter_transaction_records"."voter_transaction_log_id" = 23
---

    - @voter_transaction_log.voter_transaction_records.each do |vtr|